<?
#######################################################################################
##	
##	DATABASE接続情報
##	-----------------------------------------------------------------------------------
##	db_config.inc
##	
##	
#######################################################################################


# DATABASE接続情報
# no,接続IP,ユーザ,パス,データベース,新旧フラグ(0:新ﾃﾞｰﾀﾍﾞｰｽ or 1:旧ﾃﾞｰﾀﾍﾞｰｽ or 2:Richﾃﾞｰﾀﾍﾞｰｽ)
$db_list_ary = array(
	array('0','10.197.66.166','sqlmaster','orehasankanou','win'),	# master
	array('1','10.197.66.167','sqluser',  'orehasanshinou','win'),	# slave
	array('2','10.197.66.166','sqlmaster','orehasankanou','win'),	# backup
);



?>
