<?
#######################################################################################
##	
##	都道府県等 基本設定情報
##	-----------------------------------------------------------------------------------
##	set_config.inc
##	
##	
#######################################################################################


/**********************************************************
**
**	DEFINE
**	-------------------------------------------------------
**	
**
***********************************************************/

define('SITE_CD','1');
define('SITE_NAME','こぴへる');


/**********************************************************
**
**	文字コード指定
**	-------------------------------------------------------
**	
**
***********************************************************/

mb_internal_encoding("utf-8");
mb_http_input("auto");
mb_http_output("SJIS");


/**********************************************************
**
**	決済種別
**	-------------------------------------------------------
**	$settle_name_array
**	
***********************************************************/
/*
$settle_name_array = array(
	'0'  => 'DEFAULT',
	'1'  => 'Bank',
	'2'  => 'Credit',
	'3'  => 'BitCash',
	'4'  => 'C-Direct',
	'5'  => 'C-CHECK',
	'6'  => 'F-Regi',
	'99' => '後払い',
);
*/
$settle_name_array = array(
	'0'  => 'DEFAULT',
	'1'  => 'Bank',
	'2'  => 'Credit',
	'3'  => 'BitCash',
	'4'  => 'C-Direct',
	'5'  => 'C-CHECK',
	'6'  => 'F-Regi',
	'7'  => 'NetBank',
	'8'  => 'Edy',
	'9'  => 'G-MONEY',
	'10' => 'S-MONEY',
	'11' => 'GigaPoint',
	'12' => 'ConveniC',
	'99' => '後払い',
);

# INDEX -> NAME -> SETTLEMENT ID
/*
$settlement_array = array(
	array("0","DEFAULT",'0'),
	array("1","銀振",'1'),
	array("2","Credit",'2'),
	array("3","BitCash",'3'),
	array("4","C-Direct",'4'),
	array("5","C-CHECK",'5'),
	array("6","F-Regi",'6'),
	array("7","後払い",'99'),

);
*/

$settlement_array = array(
	array("0","DEFAULT",'0'),
	array("1","銀振",'1'),
	array("2","Credit",'2'),
	array("3","BitCash",'3'),
	array("4","C-Direct",'4'),
	array("5","C-CHECK",'5'),
	array("6","F-Regi",'6'),
	array("7","NetBank",'7'),
	array("8","Edy",'8'),
	array("9","G-MONEY",'9'),
	array("10","S-MONEY",'10'),
	array("11","GigaPoint",'11'),
	array("12","ConveniC",'12'),
	array("13","後払い",'99'),

);
?>
