<?
#######################################################################################
##	
##	DATABASE接続情報
##	-----------------------------------------------------------------------------------
##	db_config.inc
##	
##	
#######################################################################################

# DATABASE接続情報
# no,接続IP,ユーザ,パス,データベース
$db_list_ary = array(
	array('0','localhost','root','A4$xfc%3','win_copiheru'),	# master
	array('1','localhost','root',  'A4$xfc%3','win_copiheru'),	# slave
	array('2','localhost','root','A4$xfc%3','win_copiheru'),	# backup
);



?>
