<?php
################################ FILE MANAGEMENT ################################
##
##	errorController.php
##	=============================================================================
##
##	■PAGE / 
##	APP ADMIN
##	ERROR SCRIPT
##
##	=============================================================================
##
##	■MEANS / 
##	セッション破棄
##	ERROR表示処理
##
##	=============================================================================
##
##	■ CHECK / 
##	AUTHOR		: KARAT SYSTEM
##	CREATE DATE : 2016/05/31
##	CREATER		:
##
##	=============================================================================
##
##	■ REWRITE (改修履歴)
##
##
##
##
##
##
##
##
##
##
################################# REQUIRE MODEL #################################


/************************************************
**
**	MODEL FILE REQUIRE
**	---------------------------------------------
**	MODEL CLASS FILE READING
**
************************************************/

# NONE


################################# POST ARRAY ####################################

$value_array				= array('page','error_no');
$data						= $mainClass->getArrayContents($value_array,$values);

############################## INDIVIDUAL SETTING ###############################


/************************************************
**
**	ERROR ARRAY
**	---------------------------------------------
**	SETTING
**
************************************************/

$error_array				= NULL;
$error_array				= array(
	array('0','DEFAULT','0'),
	array('1','セッションが切断されました。<br />お手数ですが再度ログインしなおして下さい。','0'),
	array('2','認証失敗しました。','0'),
	array('3','アカウント情報が取得できませんでした。<br />お手数ですが再度ログインして下さい。','0'),
	array('4','契約期間が終了しております。','0'),
	array('5','ログインIDとログインパスワードを記入してログインして下さい。','0'),
);


# ERROR NO
if(!empty($error_no)){
	$data['error_no']		= $error_no;
}



/************************************************
**
**	ERROR MESSAGE
**	---------------------------------------------
**	SETTING
**
************************************************/

if(!empty($error_message)){
	$error					= $error_message;
}else{
	$error					= $error_array[$data['error_no']][1];
}


############################### SESSION DESTROY #################################


/************************************************
**
**	SESSION / COOKIE / POST
**	---------------------------------------------
**	DESTROY -> UNSET : 総ての値を破棄
**
************************************************/

# SESSION FREE
$_SESSION = array();

# SESSION DESTROY
session_destroy();

# POST UNSET
unset($_POST);

# INDEX URL
if(defined("APP_URL")){
	$return_path			= APP_URL;
}else{
	$return_path			= "/";
}


# CLOSE DATABASE
$database->closeDb();
$database->closeStmt();

//include_once(DOCUMENT_ROOT_VIEWS."/".$device_file."/templates/redirect.inc");
//exit();

################################## FILE END #####################################
?>